# Import Libraries #

In [2]:
import pandas as pd
import sqlalchemy as sa

# Import Data #

In [3]:
df = pd.read_csv("C:/Users/Hp Hc070922/Downloads/Walmart.csv")

# Display Top 5 Rows of The Dataset #

In [4]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

# Find Shape of Our Dataset (Number of Rows And Number of Columns) #

In [5]:
print('Number Of Rows : ' , df.shape[0])
print('Number Of Columns : ', df.shape[1])

Number Of Rows :  10051
Number Of Columns :  11

In [6]:
df.describe()

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

# Getting Information About Our Dataset Like Total Number Rows, Total Number of Columns, Datatypes of Each Column And Memory Requirement #

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

# ### 💰 Cleaning and Converting the `unit_price` Column

In these two lines, we clean the `unit_price` column by removing the dollar sign (`$`) and converting the values from strings to floats for numerical analysis:

```python
df['unit_price'] = df['unit_price'].str.replace('$', '', regex=False)
df['unit_price'] = df['unit_price'].astype(float)
#

In [8]:
df['unit_price'] = df['unit_price'].str.replace('$', '', regex=False)

In [9]:
df['unit_price'] = df['unit_price'].astype(float)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  float64
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(4), int64(1), object(6)
memory usage: 863.9+ KB

In [11]:
df['date'] = pd.to_datetime(df['date'])

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  float64
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  datetime64[ns]
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(1), object(5)
memory usage: 863.9+ KB

# Check For Duplicate Data and Drop Them #

In [13]:
df.duplicated().sum()

51

In [14]:
df.drop_duplicates(inplace= True)

In [15]:
print('Number Of Rows : ' , df.shape[0])
print('Number Of Columns : ', df.shape[1])

Number Of Rows :  10000
Number Of Columns :  11

# Check Null Values In The Dataset and Drop Them #

In [16]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [17]:

df.dropna(inplace=True)

# verify
df.isnull().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [18]:
print('Number Of Rows : ' , df.shape[0])
print('Number Of Columns : ', df.shape[1])

Number Of Rows :  9969
Number Of Columns :  11

#    ### 💡 Calculating Total Amount per Transaction

This line creates a new column called `total`, which represents the total amount for each transaction by multiplying the **unit price (`unit_price`)** by the **quantity (`quantity`)**:

```python
df['total'] = df['unit_price'] * df['quantity']
#

In [19]:
df['total'] = df['unit_price'] * df['quantity']

In [20]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,2019-05-01,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,2019-08-03,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,2019-03-03,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,2019-01-27,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,2019-08-02,10:37:00,Ewallet,5.3,0.48,604.17

# Fixing the column name to lower case #

In [21]:
df.columns

Index(['invoice_id', 'Branch', 'City', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin', 'total'],
      dtype='object')

In [22]:
df.columns = df.columns.str.lower()
df.columns

Index(['invoice_id', 'branch', 'city', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin', 'total'],
      dtype='object')

In [23]:
df.head()

,invoice_id,branch,city,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,2019-05-01,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,2019-08-03,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,2019-03-03,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,2019-01-27,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,2019-08-02,10:37:00,Ewallet,5.3,0.48,604.17

# ### 🔗 Exporting DataFrame to SQL Server Table

These lines connect to a SQL Server database and write the contents of a DataFrame (`df`) into a SQL table named `WAL`:

```python
engine = sa.create_engine("mssql+pyodbc://@LAPTOP-0ACJFMTN\\SQLEXPRESS/walamrt?driver=ODBC+Driver+17+for+SQL+Server&trusted_connection=yes")

df.to_sql(name='WAL', con=engine, index=False, if_exists='fail')
#

In [24]:
engine = sa.create_engine("mssql+pyodbc://@LAPTOP-0ACJFMTN\\SQLEXPRESS/walamrt?driver=ODBC+Driver+17+for+SQL+Server&trusted_connection=yes")


df.to_sql(name='WAL', con=engine, index=False, if_exists='fail')

51

# ### 💾 Saving Cleaned Data to CSV

This line exports the cleaned DataFrame `df` to a CSV file named `walmart_clean_data.csv` without including the index column:

```python
df.to_csv('walmart_clean_data.csv', index=False)
#

In [25]:
df.to_csv('walmart_clean_data.csv', index=False)